In [1]:
from pandas import Series

In [2]:
import pandas as pd

In [3]:
pd.__version__

'1.0.1'

In [4]:
# Não adicionamos o índice, logo o pandas criará a indexação para nós
Obj = Series([67, 78, -56, 13])

In [5]:
Obj

0    67
1    78
2   -56
3    13
dtype: int64

In [6]:
type(Obj)

pandas.core.series.Series

In [7]:
Obj.values

array([ 67,  78, -56,  13], dtype=int64)

In [8]:
Obj.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
# Dessa vez passamos os índices
Obj2 = Series([67, 78, -56, 13], index=['a', 'b', 'c', 'd'])

In [10]:
Obj2

a    67
b    78
c   -56
d    13
dtype: int64

In [11]:
Obj2.values

array([ 67,  78, -56,  13], dtype=int64)

In [12]:
Obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [13]:
Obj2[Obj2 > 3]

a    67
b    78
d    13
dtype: int64

In [14]:
Obj2['b']

78

In [15]:
'd' in Obj2

True

In [16]:
dict = {'Futebol': 5200, 'Tenis': 120, 'Natação': 698, 'Volleyball': 1550}

In [17]:
Obj3 = Series(dict)

In [18]:
Obj3

Futebol       5200
Tenis          120
Natação        698
Volleyball    1550
dtype: int64

In [19]:
type(Obj3)

pandas.core.series.Series

In [20]:
esportes = ['Futebol', 'Tenis', 'Natação', 'Baskteball']

In [21]:
Obj4 = Series(dict, index=esportes)

In [22]:
Obj4

Futebol       5200.0
Tenis          120.0
Natação        698.0
Baskteball       NaN
dtype: float64

In [23]:
pd.isnull(Obj4)

Futebol       False
Tenis         False
Natação       False
Baskteball     True
dtype: bool

In [24]:
pd.notnull(Obj4)

Futebol        True
Tenis          True
Natação        True
Baskteball    False
dtype: bool

In [25]:
Obj4.isnull()

Futebol       False
Tenis         False
Natação       False
Baskteball     True
dtype: bool

In [26]:
Obj3 + Obj4

Baskteball        NaN
Futebol       10400.0
Natação        1396.0
Tenis           240.0
Volleyball        NaN
dtype: float64

In [27]:
Obj4.name = 'população'
Obj4.index.name = 'esporte'

In [28]:
Obj4

esporte
Futebol       5200.0
Tenis          120.0
Natação        698.0
Baskteball       NaN
Name: população, dtype: float64

# DataFrames

### Similar a tabelas de banco de dados relacional ou planilhas de excel

In [29]:
from pandas import DataFrame

In [30]:
data = {'Estado': ['Santa Catarina', 'Paraná', 'Goiás', 'Bahia', 'Minas Gerais'],
       'Ano': [2002, 2003, 2004, 2005, 2006],
       'População': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [31]:
frame = DataFrame(data)

In [32]:
frame

           Estado   Ano  População
0  Santa Catarina  2002        1.5
1          Paraná  2003        1.7
2           Goiás  2004        3.6
3           Bahia  2005        2.4
4    Minas Gerais  2006        2.9

In [33]:
type(frame)

pandas.core.frame.DataFrame

In [34]:
DataFrame(data, columns=['Ano', 'Estado', 'População'])

    Ano          Estado  População
0  2002  Santa Catarina        1.5
1  2003          Paraná        1.7
2  2004           Goiás        3.6
3  2005           Bahia        2.4
4  2006    Minas Gerais        2.9

In [35]:
frame2 = DataFrame(data, columns=['Ano', 'Estado', 'População', 'Débito'], 
                   index=['um', 'dois', 'tres', 'quatro', 'cinco'])

In [36]:
frame2

         Ano          Estado  População Débito
um      2002  Santa Catarina        1.5    NaN
dois    2003          Paraná        1.7    NaN
tres    2004           Goiás        3.6    NaN
quatro  2005           Bahia        2.4    NaN
cinco   2006    Minas Gerais        2.9    NaN

In [37]:
# Filtro por nome de coluna
frame2['Estado']

um        Santa Catarina
dois              Paraná
tres               Goiás
quatro             Bahia
cinco       Minas Gerais
Name: Estado, dtype: object

In [38]:
type(frame2)

pandas.core.frame.DataFrame

In [39]:
frame2.index

Index(['um', 'dois', 'tres', 'quatro', 'cinco'], dtype='object')

In [40]:
frame2.columns

Index(['Ano', 'Estado', 'População', 'Débito'], dtype='object')

In [41]:
frame2.values

array([[2002, 'Santa Catarina', 1.5, nan],
       [2003, 'Paraná', 1.7, nan],
       [2004, 'Goiás', 3.6, nan],
       [2005, 'Bahia', 2.4, nan],
       [2006, 'Minas Gerais', 2.9, nan]], dtype=object)

In [42]:
frame2.dtypes

Ano            int64
Estado        object
População    float64
Débito        object
dtype: object

In [43]:
frame2['Ano']

um        2002
dois      2003
tres      2004
quatro    2005
cinco     2006
Name: Ano, dtype: int64

In [44]:
frame2.Ano

um        2002
dois      2003
tres      2004
quatro    2005
cinco     2006
Name: Ano, dtype: int64

In [45]:
frame2[:2]

       Ano          Estado  População Débito
um    2002  Santa Catarina        1.5    NaN
dois  2003          Paraná        1.7    NaN

# Usando Numpy e Pandas!!!!

In [46]:
import numpy as np

In [53]:
# Aqui utilizamos o numpy para alimentar uma das colunas do DataFrame
frame2['Débito'] = np.arange(5.)

In [54]:
frame2

         Ano          Estado  População  Débito
um      2002  Santa Catarina        1.5     0.0
dois    2003          Paraná        1.7     1.0
tres    2004           Goiás        3.6     2.0
quatro  2005           Bahia        2.4     3.0
cinco   2006    Minas Gerais        2.9     4.0

In [55]:
frame2.values

array([[2002, 'Santa Catarina', 1.5, 0.0],
       [2003, 'Paraná', 1.7, 1.0],
       [2004, 'Goiás', 3.6, 2.0],
       [2005, 'Bahia', 2.4, 3.0],
       [2006, 'Minas Gerais', 2.9, 4.0]], dtype=object)

In [58]:
frame2.describe()

               Ano  População    Débito
count     5.000000   5.000000  5.000000
mean   2004.000000   2.420000  2.000000
std       1.581139   0.864292  1.581139
min    2002.000000   1.500000  0.000000
25%    2003.000000   1.700000  1.000000
50%    2004.000000   2.400000  2.000000
75%    2005.000000   2.900000  3.000000
max    2006.000000   3.600000  4.000000

In [59]:
frame2['dois':'quatro']

         Ano  Estado  População  Débito
dois    2003  Paraná        1.7     1.0
tres    2004   Goiás        3.6     2.0
quatro  2005   Bahia        2.4     3.0

In [99]:
frame2 < 5

TypeError: '<' not supported between instances of 'str' and 'int'

# Localizando Registros Dentro do Datraframe

In [100]:
# Localiza pelo nome da linha
frame2.loc['quatro']

Ano           2005
Estado       Bahia
População      2.4
Débito           3
Name: quatro, dtype: object

In [101]:
# Localiza pelo index 2
frame2.iloc[2]

Ano           2004
Estado       Goiás
População      3.6
Débito           2
Name: tres, dtype: object

# Invertendo as Colunas e Índices

In [102]:
web_status = {
    'Dias': [1, 2, 3, 4, 5, 6, 7],
    'Visitantes': [45, 23, 67, 78, 23, 12, 14],
    'Taxas': [11, 22, 33, 44, 55, 66, 77]
}

In [104]:
df = pd.DataFrame(web_status)

In [105]:
print(df)

   Dias  Visitantes  Taxas
0     1          45     11
1     2          23     22
2     3          67     33
3     4          78     44
4     5          23     55
5     6          12     66
6     7          14     77

In [106]:
print(df.set_index('Dias'))

      Visitantes  Taxas
Dias
1             45     11
2             23     22
3             67     33
4             78     44
5             23     55
6             12     66
7             14     77

In [107]:
print(df.head())

   Dias  Visitantes  Taxas
0     1          45     11
1     2          23     22
2     3          67     33
3     4          78     44
4     5          23     55

In [108]:
print(df[['Visitantes', 'Taxas']])

   Visitantes  Taxas
0          45     11
1          23     22
2          67     33
3          78     44
4          23     55
5          12     66
6          14     77